[
  {
    "title": "Resolving Missing VIP Membership Points",
    "situation": "During a loyalty program project, VIP members' points went missing over Christmas. Time-sensitive issue as points needed to be used by year-end.",
    "story": "During a loyalty program project, we encountered a critical issue where some VIP members' points went missing during the Christmas period. This was a major problem because these VIP members needed to use their points before the end of the year, making it a time-sensitive issue. To resolve this, I collaborated closely with the development team to find the root cause. We worked long hours and managed to implement an urgent fix that restored the missing points within just one day. To ensure this wouldn't happen again, we also put in place a more permanent solution. The result was that the points were restored quickly, and the client was extremely impressed with our dedication and deep understanding of the system. This not only solved the immediate issue but also improved our relationship with the client, showing them they could rely on us in critical situations."
  },
  {
    "title": "Addressing UAT Complaints and Ensuring On-Time Launch",
    "situation": "Users complained about system and data quality during UAT. System developed by previous vendor, migrated data not meeting expectations. Users wanted improvements but insisted on keeping the original launch date.",
    "story": "During the User Acceptance Testing (UAT) phase of a project, we received several complaints from users about system and data quality issues. The system had been developed by a previous vendor, and the migrated data was not meeting their expectations. They requested improvements but insisted on keeping the original launch date. To address their concerns, I traveled to Macau to meet with key users and gather their feedback directly. I led a functional team and collaborated with the development team to identify necessary changes and estimate the effort required. We prepared a clear document detailing the requirements/issues, suggested solutions, and effort estimates, which we used to explain the situation to key users. Additionally, I discussed the situation with senior management to finalize decisions on changes needed for a conditional launch. We also prepared a detailed post-launch support plan to address nice-to-have requirements. As a result, the project launched on time, and users were satisfied with the improvements. The client appreciated our prompt response and dedication to addressing their concerns, which helped build their trust in our team."
  },
  {
    "title": "Digital Transformation Project",
    "situation": "Hired for digital transformation project with tight deadline. Project progress poor due to messy management. Client team deliverables not effective.",
    "story": "In my last project, we were hired to assist with a digital transformation project with a tight deadline. The project progress was not good due to messy management and deliverables from the client team were not effective. My role was to collaborate with various business and operational teams to understand their current workflows. I also worked with solution architects to design future-state solutions, ensuring that these new workflows aligned with the company's strategic direction and included integrating Salesforce products with customized applications and systems. To keep the project on schedule, we set up clear priorities and maintained effective communication to speed up the project. We drafted detailed business diagrams for the to-be solution as key deliverables, ensuring all involved parties understood their duties and responsibilities and system data flow. Clients said they were very satisfied with the quality of our deliverables and the significant progress we made. They discontinued our contract due to budget constraints, but we were the last vendor to leave the project, demonstrating the value we brought to the table."
  }
]
